# DBeam_SetTShutDepth

## Description
```pascal
PROCEDURE DBeam_SetTShutDepth(depth : INTEGER);
```

```python

def vs.DBeam_SetTShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight